Revit 2027 API
PlumbingUtils.ConnectPipePlaceholdersAtCross(Document, Connector, Connector, Connector, Connector) Method
 Connects placeholders that looks like Cross connection.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool ConnectPipePlaceholdersAtCross(
	Document document,
	Connector connector1,
	Connector connector2,
	Connector connector3,
	Connector connector4
)
Public Shared Function ConnectPipePlaceholdersAtCross (
	document As Document,
	connector1 As Connector,
	connector2 As Connector,
	connector3 As Connector,
	connector4 As Connector
) As Boolean
public:
static bool ConnectPipePlaceholdersAtCross(
	Document^ document,
	Connector^ connector1,
	Connector^ connector2,
	Connector^ connector3,
	Connector^ connector4
)
static member ConnectPipePlaceholdersAtCross :
        document : Document *
        connector1 : Connector *
        connector2 : Connector *
        connector3 : Connector *
        connector4 : Connector -> bool
Parameters
document Document
 The document.
connector1 Connector
 The first end connector of placeholder to be connected to the second.
connector2 Connector
 The second end connector of placeholder to be connected to the first.
connector3 Connector
 The third end connector of placeholder to be connected to the forth.
connector4 Connector
 The fourth end connector of placeholder to be connected to the third.
Return Value
Boolean
 True if connection succeeds, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  The owner of connector is not pipe placeholder. -or- The owners of connectors belong to different types of system. -or- The curves of connector1 and connector2 are not collinear or either the connecto1 or connector2 is not connector of curve end.
ArgumentNullException |  A non-optional argument was null
Remarks
 The placeholders may or may not have physical connection. However a) The ends of four connectors should intersect at same point; b) the first and second placeholders should be collinear each other; c) the third and fourth placeholders should be collinear each other and d) the third and fourth should have intersection with first or second placeholder. If connection fails, the placeholders cannot be physically connected.
See Also
Reference
PlumbingUtils Class
ConnectPipePlaceholdersAtCross Overload
Autodesk.Revit.DB.Plumbing Namespace